       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-CONSOLE.

       DATA DIVISION.
       LINKAGE SECTION.
       01 MSG PIC A(20).

       PROCEDURE DIVISION USING MSG.

       HELLO-CONSOLE.
           DISPLAY MSG.
